/****************************************************************************** 
 *       delay.c ----- The delay Functions          *
 *       (c) Copyright 2012 HUST RENESAS LAB,The Department of CSE, HUST       *
 *                        All Rights Reserved                                  *
 *Filename             :  delay.c                                           *
 *Programmer(s)        :  Yang Xiang                                           *
 *Description          :                                                       *
 *Modification History :                                                       *
 *01a 2014/3/30 19:50:56                                                       *
 ******************************************************************************/

#include "delay.h"

/*************************************************************************
*                             野火嵌入式开发工作室
*
*  函数名称：delayms
*  功能说明：延时函数（不准确），内核频率为100M时较为准确
*  参数说明：无
*  函数返回：无
*  修改时间：2012-2-1    已测试
*  备    注：
*************************************************************************/
void  delayms(uint32  ms)
{

    uint32  i, j;
    for(i = 0; i < ms; i++)
    {
        for(j = (g_bus_clock / 1000); j > 0; j--)
        {
            asm("nop");
        }
    }
}
void delayus(uint32 us)
{
    uint32  i, j;
    for(i = 0; i < us; i++)
    {
        for(j = (g_bus_clock / 1000000); j > 0; j--)
        {
            asm("nop");
        }
    }    
}
/*************************************************************************
*                             野火嵌入式开发工作室
*
*  函数名称：Pause
*  功能说明：延时，I2C读写后，需要延时一下
*  参数说明：无
*  函数返回：无
*  修改时间：2012-1-20
*  备    注：在官方基础上增大延时数
*************************************************************************/
void Pause(void)
{
    uint16 n;
    for(n = 1; n < 50000; n++)      //注意，这个数据太小，会导致读取错误。
    {
        asm("nop");
    }
}
/*************************************************************************
*
*  函数名称：Delay5us
*  功能说明：延时，I2C时序控制
*  参数说明：无
*  函数返回：无
*  修改时间：2012-1-20
*  备    注：在官方基础上增大延时数
*************************************************************************/
void Delay5us()
{
    int i = 0;
    for(i = 0; i < 500; i++)
    {

    }
}
